#### Terraform Plan 📖
```module.delete-failed-alarms.data.archive_file.delete-function-zip: Reading...
module.api.data.archive_file.update-function-zip: Reading...
module.layer.data.archive_file.layer_zip: Reading...
module.alarm-trigger.data.archive_file.trigger-function-zip: Reading...
module.api.data.archive_file.delete-function-zip: Reading...
module.api.data.archive_file.create-function-zip: Reading...
module.api.data.archive_file.delete-function-zip: Read complete after 0s [id=1012d83b1cdbb66c25d8325819341f48a8cca17a]
module.delete-failed-alarms.data.archive_file.delete-function-zip: Read complete after 0s [id=c19f74b80ab83af66f1f097ab40c61678e576d3e]
module.api.data.archive_file.create-function-zip: Read complete after 0s [id=f77e090d05f04e46336d1f9f9ee0ac4ffa0c33d8]
module.api.data.archive_file.update-function-zip: Read complete after 0s [id=ecd57e8c3d7f8f52ecb56f628f375e25cf1e600e]
module.alarm-trigger.data.archive_file.trigger-function-zip: Read complete after 0s [id=df8cefdc6fee537082d19ea6512a57b8843d3a9f]
module.alarm-trigger.data.aws_region.current: Reading...
module.alarm-trigger.data.aws_caller_identity.current: Reading...
module.delete-failed-alarms.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.api.aws_cloudwatch_log_group.throwtrash-alarm-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm]
module.api.aws_api_gateway_rest_api.api: Refreshing state... [id=ylt5sxzsod]
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Reading...
module.delete-failed-alarms.aws_sqs_queue.alarm_delete_queue_deadletter: Refreshing state... [id=https://sqs.ap-northeast-1.amazonaws.com/188970983837/throwtrash-alarm-delete-failed-alarms-queue-deadletter]
module.api-gateway-prod-stage[0].aws_api_gateway_api_key.api-key-prod-v2: Refreshing state... [id=hiry9xjdzl]
module.api.aws_dynamodb_table.throwtrash-alarm-table: Refreshing state... [id=throwtrash-alarm]
module.delete-failed-alarms.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Read complete after 0s [id=52247394]
module.api.data.aws_caller_identity.current: Reading...
module.alarm-trigger.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.delete-failed-alarms.aws_cloudwatch_log_group.throwtrash-alarm-delete-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm-delete-failed-alarms]
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api-gateway-prod-stage[0].aws_api_gateway_api_key.api-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.alarm-trigger.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.api-gateway-prod-stage[0].aws_api_gateway_domain_name.api-domain-name: Refreshing state... [id=alarm.mythrowaway.net]
module.api.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=188970983837]
module.delete-failed-alarms.data.aws_region.current: Reading...
module.delete-failed-alarms.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.delete-failed-alarms.data.aws_caller_identity.current: Reading...
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api.data.aws_region.current: Reading...
module.api.aws_api_gateway_api_key.api-key-dev: Refreshing state... [id=mtw89qlbs2]
module.api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.alarm-trigger.aws_cloudwatch_log_group.throwtrash-alarm-trigger-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm-trigger]
module.api.aws_scheduler_schedule_group.throwtrash-alarm-schedule-group: Refreshing state... [id=throwtrash-alarm-schedule-group]
module.delete-failed-alarms.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.api.aws_iam_role.throwtrash-alarm-scheduler-role: Refreshing state... [id=throwtrash-alarm-scheduler-role]
module.delete-failed-alarms.aws_iam_role.throwtrash-alarm-delete-lambda-role: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms-lambda-role]
module.api.aws_iam_role.throwtrash-alarm-lambda-role: Refreshing state... [id=throwtrash-alarm-lambda-role]
module.alarm-trigger.aws_iam_role.throwtrash-alarm-trigger-lambda-role: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role]
module.api-gateway-prod-stage[0].aws_route53_record.route53-record: Refreshing state... [id=Z5UYE2IX50J9A_alarm.mythrowaway.net_A]
module.delete-failed-alarms.aws_sqs_queue.alarm_delete_queue: Refreshing state... [id=https://sqs.ap-northeast-1.amazonaws.com/188970983837/throwtrash-alarm-delete-failed-alarms-queue]
module.api.aws_api_gateway_resource.api-resource-delete: Refreshing state... [id=nkks0s]
module.api.aws_api_gateway_resource.api-resource-update: Refreshing state... [id=k5ktnr]
module.api.aws_api_gateway_resource.api-resource-create: Refreshing state... [id=wipuw0]
module.api.aws_api_gateway_method.api-method-delete: Refreshing state... [id=agm-ylt5sxzsod-nkks0s-DELETE]
module.api.aws_iam_policy.throwtrash-alarm-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-lambda-policy]
module.api.aws_api_gateway_method.api-method-put: Refreshing state... [id=agm-ylt5sxzsod-k5ktnr-PUT]
module.api.aws_api_gateway_method.api-method-post: Refreshing state... [id=agm-ylt5sxzsod-wipuw0-POST]
module.api.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-lambda-role-20240429132809078300000002]
module.api-gateway-prod-stage[0].aws_api_gateway_deployment.api-deployment-prod: Refreshing state... [id=uuaip0]
module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v2: Refreshing state... [id=ags-ylt5sxzsod-v2]
module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v1: Refreshing state... [id=ags-ylt5sxzsod-v1]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v1]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan.usage-plan-prod-v1: Refreshing state... [id=u56dai]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v1]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v1]
module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping-v2: Refreshing state... [id=alarm.mythrowaway.net/]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan.usage-plan-prod-v2: Refreshing state... [id=78fkm7]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan_key.api-plan-key-prod-v2: Refreshing state... [id=hiry9xjdzl]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan_key.api-plan-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v1: Refreshing state... [id=terraform-20240502175439070600000003]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v1: Refreshing state... [id=terraform-20240502175439018500000002]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v1: Refreshing state... [id=terraform-20240502175438382900000001]
module.layer.data.archive_file.layer_zip: Read complete after 4s [id=5358f96aaf8e30cc6a719437778712c954aed9b8]
module.layer.aws_lambda_layer_version.layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:30]
module.api.aws_lambda_function.throwtrash-alarm-delete-lambda: Refreshing state... [id=throwtrash-alarm-delete]
module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda: Refreshing state... [id=throwtrash-alarm-trigger]
module.delete-failed-alarms.aws_lambda_function.throwtrash-alarm-delete-lambda: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms]
module.delete-failed-alarms.aws_iam_policy.throwtrash-alarm-delete-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-delete-failed-alarms-lambda-policy]
module.delete-failed-alarms.aws_lambda_event_source_mapping.sqs_event_source: Refreshing state... [id=4f0a182a-c8c3-4074-b237-de8d92a46774]
module.api.aws_lambda_alias.throwtrash-delete-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:dev]
module.api.aws_api_gateway_integration.api-integration-delete: Refreshing state... [id=agi-ylt5sxzsod-nkks0s-DELETE]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v2: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v2]
module.alarm-trigger.aws_lambda_function_event_invoke_config.throwtrash-alarm-trigger-lambda-event-invoke-config: Refreshing state... [id=throwtrash-alarm-trigger]
module.alarm-trigger.aws_iam_policy.throwtrash-alarm-trigger-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-trigger-lambda-policy]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0]: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:dev]
module.api.aws_lambda_function.throwtrash-alarm-update-lambda: Refreshing state... [id=throwtrash-alarm-update]
module.api.aws_iam_policy.throwtrash-alarm-scheduler-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-scheduler-policy]
module.delete-failed-alarms.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms-lambda-role-20250127153930440600000001]
module.api.aws_lambda_function.throwtrash-alarm-create-lambda: Refreshing state... [id=throwtrash-alarm-create]
module.api.aws_lambda_permission.throwtrash-delete-permission-apigw: Refreshing state... [id=terraform-20240429131802029300000004]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v2: Refreshing state... [id=terraform-20260301070524801500000001]
module.alarm-trigger.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role-20240429131751105100000002]
module.api.aws_iam_role_policy_attachment.scheduler-policy-attachment: Refreshing state... [id=throwtrash-alarm-scheduler-role-20240429131751028900000001]
module.api.aws_lambda_alias.throwtrash-update-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:dev]
module.api.aws_api_gateway_integration.api-integration-update: Refreshing state... [id=agi-ylt5sxzsod-k5ktnr-PUT]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v2: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v2]
module.api.aws_lambda_alias.throwtrash-create-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:dev]
module.api.aws_api_gateway_integration.api-integration-create: Refreshing state... [id=agi-ylt5sxzsod-wipuw0-POST]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v2: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v2]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v2: Refreshing state... [id=terraform-20260301070546808500000002]
module.api.aws_lambda_permission.throwtrash-update-permission-apigw: Refreshing state... [id=terraform-20240429132827320000000006]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v2: Refreshing state... [id=terraform-20260301070555190300000003]
module.api.aws_lambda_permission.throwtrash-create-permission-apigw: Refreshing state... [id=terraform-20240429132817896500000004]
module.api.aws_api_gateway_deployment.api-deployment-dev: Refreshing state... [id=78em6t]
module.api.aws_api_gateway_stage.api-stage-dev: Refreshing state... [id=ags-ylt5sxzsod-dev]
module.api.aws_api_gateway_usage_plan.usage-plan-dev: Refreshing state... [id=4hwsh7]
module.api.aws_api_gateway_usage_plan_key.api-plan-key-dev: Refreshing state... [id=mtw89qlbs2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0] will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-trigger-prod" {
      ~ function_version = "18" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod"
        name             = "prod"
        # (4 unchanged attributes hidden)
    }

  # module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-trigger-lambda" {
        id                             = "throwtrash-alarm-trigger"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:18/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "18" -> (known after apply)
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-create-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-create-lambda" {
        id                             = "throwtrash-alarm-create"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:17/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "17" -> (known after apply)
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-delete-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:18/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "18" -> (known after apply)
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-update-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-update-lambda" {
        id                             = "throwtrash-alarm-update"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:17/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "17" -> (known after apply)
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping-v1 will be created
  + resource "aws_api_gateway_base_path_mapping" "api-base-path-mapping-v1" {
      + api_id      = "ylt5sxzsod"
      + base_path   = "v1"
      + domain_name = "alarm.mythrowaway.net"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping-v2 will be updated in-place
  ~ resource "aws_api_gateway_base_path_mapping" "api-base-path-mapping-v2" {
      + base_path      = "v2"
        id             = "alarm.mythrowaway.net/"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v2 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-create-alias-v2" {
      ~ function_version = "17" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v2"
        name             = "v2"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v2 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-delete-alias-v2" {
      ~ function_version = "18" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v2"
        name             = "v2"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v2 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-update-alias-v2" {
      ~ function_version = "17" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v2"
        name             = "v2"
        # (4 unchanged attributes hidden)
    }

  # module.delete-failed-alarms.aws_lambda_function.throwtrash-alarm-delete-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete-failed-alarms"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete-failed-alarms:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete-failed-alarms:2/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "2" -> (known after apply)
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 10 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
stdout<<ghadelimiter_8a023105-7f28-4171-9f60-3951370f7be6
module.delete-failed-alarms.data.archive_file.delete-function-zip: Reading...
module.api.data.archive_file.update-function-zip: Reading...
module.layer.data.archive_file.layer_zip: Reading...
module.alarm-trigger.data.archive_file.trigger-function-zip: Reading...
module.api.data.archive_file.delete-function-zip: Reading...
module.api.data.archive_file.create-function-zip: Reading...
module.api.data.archive_file.delete-function-zip: Read complete after 0s [id=1012d83b1cdbb66c25d8325819341f48a8cca17a]
module.delete-failed-alarms.data.archive_file.delete-function-zip: Read complete after 0s [id=c19f74b80ab83af66f1f097ab40c61678e576d3e]
module.api.data.archive_file.create-function-zip: Read complete after 0s [id=f77e090d05f04e46336d1f9f9ee0ac4ffa0c33d8]
module.api.data.archive_file.update-function-zip: Read complete after 0s [id=ecd57e8c3d7f8f52ecb56f628f375e25cf1e600e]
module.alarm-trigger.data.archive_file.trigger-function-zip: Read complete after 0s [id=df8cefdc6fee537082d19ea6512a57b8843d3a9f]
module.alarm-trigger.data.aws_region.current: Reading...
module.alarm-trigger.data.aws_caller_identity.current: Reading...
module.delete-failed-alarms.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.api.aws_cloudwatch_log_group.throwtrash-alarm-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm]
module.api.aws_api_gateway_rest_api.api: Refreshing state... [id=ylt5sxzsod]
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Reading...
module.delete-failed-alarms.aws_sqs_queue.alarm_delete_queue_deadletter: Refreshing state... [id=https://sqs.ap-northeast-1.amazonaws.com/188970983837/throwtrash-alarm-delete-failed-alarms-queue-deadletter]
module.api-gateway-prod-stage[0].aws_api_gateway_api_key.api-key-prod-v2: Refreshing state... [id=hiry9xjdzl]
module.api.aws_dynamodb_table.throwtrash-alarm-table: Refreshing state... [id=throwtrash-alarm]
module.delete-failed-alarms.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Read complete after 0s [id=52247394]
module.api.data.aws_caller_identity.current: Reading...
module.alarm-trigger.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.delete-failed-alarms.aws_cloudwatch_log_group.throwtrash-alarm-delete-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm-delete-failed-alarms]
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api-gateway-prod-stage[0].aws_api_gateway_api_key.api-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.alarm-trigger.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.api-gateway-prod-stage[0].aws_api_gateway_domain_name.api-domain-name: Refreshing state... [id=alarm.mythrowaway.net]
module.api.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=188970983837]
module.delete-failed-alarms.data.aws_region.current: Reading...
module.delete-failed-alarms.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.delete-failed-alarms.data.aws_caller_identity.current: Reading...
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api.data.aws_region.current: Reading...
module.api.aws_api_gateway_api_key.api-key-dev: Refreshing state... [id=mtw89qlbs2]
module.api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.alarm-trigger.aws_cloudwatch_log_group.throwtrash-alarm-trigger-log-group: Refreshing state... [id=/aws/lambda/throwtrash-alarm-trigger]
module.api.aws_scheduler_schedule_group.throwtrash-alarm-schedule-group: Refreshing state... [id=throwtrash-alarm-schedule-group]
module.delete-failed-alarms.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.api.aws_iam_role.throwtrash-alarm-scheduler-role: Refreshing state... [id=throwtrash-alarm-scheduler-role]
module.delete-failed-alarms.aws_iam_role.throwtrash-alarm-delete-lambda-role: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms-lambda-role]
module.api.aws_iam_role.throwtrash-alarm-lambda-role: Refreshing state... [id=throwtrash-alarm-lambda-role]
module.alarm-trigger.aws_iam_role.throwtrash-alarm-trigger-lambda-role: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role]
module.api-gateway-prod-stage[0].aws_route53_record.route53-record: Refreshing state... [id=Z5UYE2IX50J9A_alarm.mythrowaway.net_A]
module.delete-failed-alarms.aws_sqs_queue.alarm_delete_queue: Refreshing state... [id=https://sqs.ap-northeast-1.amazonaws.com/188970983837/throwtrash-alarm-delete-failed-alarms-queue]
module.api.aws_api_gateway_resource.api-resource-delete: Refreshing state... [id=nkks0s]
module.api.aws_api_gateway_resource.api-resource-update: Refreshing state... [id=k5ktnr]
module.api.aws_api_gateway_resource.api-resource-create: Refreshing state... [id=wipuw0]
module.api.aws_api_gateway_method.api-method-delete: Refreshing state... [id=agm-ylt5sxzsod-nkks0s-DELETE]
module.api.aws_iam_policy.throwtrash-alarm-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-lambda-policy]
module.api.aws_api_gateway_method.api-method-put: Refreshing state... [id=agm-ylt5sxzsod-k5ktnr-PUT]
module.api.aws_api_gateway_method.api-method-post: Refreshing state... [id=agm-ylt5sxzsod-wipuw0-POST]
module.api.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-lambda-role-20240429132809078300000002]
module.api-gateway-prod-stage[0].aws_api_gateway_deployment.api-deployment-prod: Refreshing state... [id=uuaip0]
module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v2: Refreshing state... [id=ags-ylt5sxzsod-v2]
module.api-gateway-prod-stage[0].aws_api_gateway_stage.api-stage-prod-v1: Refreshing state... [id=ags-ylt5sxzsod-v1]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v1]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan.usage-plan-prod-v1: Refreshing state... [id=u56dai]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v1]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v1: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v1]
module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping-v2: Refreshing state... [id=alarm.mythrowaway.net/]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan.usage-plan-prod-v2: Refreshing state... [id=78fkm7]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan_key.api-plan-key-prod-v2: Refreshing state... [id=hiry9xjdzl]
module.api-gateway-prod-stage[0].aws_api_gateway_usage_plan_key.api-plan-key-prod-v1: Refreshing state... [id=4rkujey9ml]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v1: Refreshing state... [id=terraform-20240502175439070600000003]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v1: Refreshing state... [id=terraform-20240502175439018500000002]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v1: Refreshing state... [id=terraform-20240502175438382900000001]
module.layer.data.archive_file.layer_zip: Read complete after 4s [id=5358f96aaf8e30cc6a719437778712c954aed9b8]
module.layer.aws_lambda_layer_version.layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:layer:throwtrash-alarm-libs:30]
module.api.aws_lambda_function.throwtrash-alarm-delete-lambda: Refreshing state... [id=throwtrash-alarm-delete]
module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda: Refreshing state... [id=throwtrash-alarm-trigger]
module.delete-failed-alarms.aws_lambda_function.throwtrash-alarm-delete-lambda: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms]
module.delete-failed-alarms.aws_iam_policy.throwtrash-alarm-delete-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-delete-failed-alarms-lambda-policy]
module.delete-failed-alarms.aws_lambda_event_source_mapping.sqs_event_source: Refreshing state... [id=4f0a182a-c8c3-4074-b237-de8d92a46774]
module.api.aws_lambda_alias.throwtrash-delete-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:dev]
module.api.aws_api_gateway_integration.api-integration-delete: Refreshing state... [id=agi-ylt5sxzsod-nkks0s-DELETE]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v2: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v2]
module.alarm-trigger.aws_lambda_function_event_invoke_config.throwtrash-alarm-trigger-lambda-event-invoke-config: Refreshing state... [id=throwtrash-alarm-trigger]
module.alarm-trigger.aws_iam_policy.throwtrash-alarm-trigger-lambda-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-trigger-lambda-policy]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0]: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod]
module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:dev]
module.api.aws_lambda_function.throwtrash-alarm-update-lambda: Refreshing state... [id=throwtrash-alarm-update]
module.api.aws_iam_policy.throwtrash-alarm-scheduler-policy: Refreshing state... [id=arn:aws:iam::188970983837:policy/throwtrash-alarm-scheduler-policy]
module.delete-failed-alarms.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-delete-failed-alarms-lambda-role-20250127153930440600000001]
module.api.aws_lambda_function.throwtrash-alarm-create-lambda: Refreshing state... [id=throwtrash-alarm-create]
module.api.aws_lambda_permission.throwtrash-delete-permission-apigw: Refreshing state... [id=terraform-20240429131802029300000004]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-delete-permission-apigw-v2: Refreshing state... [id=terraform-20260301070524801500000001]
module.alarm-trigger.aws_iam_role_policy_attachment.lambda-policy-attachment: Refreshing state... [id=throwtrash-alarm-trigger-lambda-role-20240429131751105100000002]
module.api.aws_iam_role_policy_attachment.scheduler-policy-attachment: Refreshing state... [id=throwtrash-alarm-scheduler-role-20240429131751028900000001]
module.api.aws_lambda_alias.throwtrash-update-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:dev]
module.api.aws_api_gateway_integration.api-integration-update: Refreshing state... [id=agi-ylt5sxzsod-k5ktnr-PUT]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v2: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v2]
module.api.aws_lambda_alias.throwtrash-create-dev: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:dev]
module.api.aws_api_gateway_integration.api-integration-create: Refreshing state... [id=agi-ylt5sxzsod-wipuw0-POST]
module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v2: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v2]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-update-permission-apigw-v2: Refreshing state... [id=terraform-20260301070546808500000002]
module.api.aws_lambda_permission.throwtrash-update-permission-apigw: Refreshing state... [id=terraform-20240429132827320000000006]
module.api-gateway-prod-stage[0].aws_lambda_permission.throwtrash-create-permission-apigw-v2: Refreshing state... [id=terraform-20260301070555190300000003]
module.api.aws_lambda_permission.throwtrash-create-permission-apigw: Refreshing state... [id=terraform-20240429132817896500000004]
module.api.aws_api_gateway_deployment.api-deployment-dev: Refreshing state... [id=78em6t]
module.api.aws_api_gateway_stage.api-stage-dev: Refreshing state... [id=ags-ylt5sxzsod-dev]
module.api.aws_api_gateway_usage_plan.usage-plan-dev: Refreshing state... [id=4hwsh7]
module.api.aws_api_gateway_usage_plan_key.api-plan-key-dev: Refreshing state... [id=mtw89qlbs2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-prod[0] will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-trigger-prod" {
      ~ function_version = "18" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:prod"
        name             = "prod"
        # (4 unchanged attributes hidden)
    }

  # module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-trigger-lambda" {
        id                             = "throwtrash-alarm-trigger"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-trigger:18/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "18" -> (known after apply)
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-create-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-create-lambda" {
        id                             = "throwtrash-alarm-create"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:17/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "17" -> (known after apply)
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-delete-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:18/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "18" -> (known after apply)
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_lambda_function.throwtrash-alarm-update-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-update-lambda" {
        id                             = "throwtrash-alarm-update"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:17/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "17" -> (known after apply)
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping-v1 will be created
  + resource "aws_api_gateway_base_path_mapping" "api-base-path-mapping-v1" {
      + api_id      = "ylt5sxzsod"
      + base_path   = "v1"
      + domain_name = "alarm.mythrowaway.net"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # module.api-gateway-prod-stage[0].aws_api_gateway_base_path_mapping.api-base-path-mapping-v2 will be updated in-place
  ~ resource "aws_api_gateway_base_path_mapping" "api-base-path-mapping-v2" {
      + base_path      = "v2"
        id             = "alarm.mythrowaway.net/"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-create-alias-v2 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-create-alias-v2" {
      ~ function_version = "17" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-create:v2"
        name             = "v2"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-delete-alias-v2 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-delete-alias-v2" {
      ~ function_version = "18" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete:v2"
        name             = "v2"
        # (4 unchanged attributes hidden)
    }

  # module.api-gateway-prod-stage[0].aws_lambda_alias.throwtrash-update-alias-v2 will be updated in-place
  ~ resource "aws_lambda_alias" "throwtrash-update-alias-v2" {
      ~ function_version = "17" -> (known after apply)
        id               = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-update:v2"
        name             = "v2"
        # (4 unchanged attributes hidden)
    }

  # module.delete-failed-alarms.aws_lambda_function.throwtrash-alarm-delete-lambda will be updated in-place
  ~ resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
        id                             = "throwtrash-alarm-delete-failed-alarms"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete-failed-alarms:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:188970983837:function:throwtrash-alarm-delete-failed-alarms:2/invocations" -> (known after apply)
        tags                           = {
            "app"   = "throwtrash"
            "group" = "alarm"
        }
      ~ version                        = "2" -> (known after apply)
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 10 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

ghadelimiter_8a023105-7f28-4171-9f60-3951370f7be6
stderr<<ghadelimiter_31979a1b-8322-4dd8-861f-7333d20fcb60

ghadelimiter_31979a1b-8322-4dd8-861f-7333d20fcb60
exitcode<<ghadelimiter_ce6a9d68-21a3-416e-9644-e0ac5136cbe9
0
ghadelimiter_ce6a9d68-21a3-416e-9644-e0ac5136cbe9```